/*
Реализовать функцию сложения матриц.
Функция принимает два двумерных массива и возвращает сумму этих массив в виде нового двумерного массива.
|1 2 3|     |2 2 1|     |1+2 2+2 3+1|     |3 4 4|
|3 2 1|  +  |3 2 3|  =  |3+3 2+2 1+3|  =  |6 4 4|
|1 1 1|     |1 1 3|     |1+1 1+1 1+3|     |2 2 4|
matrixAddition(
    [  [1, 2],
        [1, 2]  ],
//    +
    [ [2, 3],
        [2, 3] ] ),
//    =
    [ [3, 5],
        [3, 5] ] );
*/

function matrixAddition(matrix1, matrix2) {
    return matrix1.map(((value1, index1) => value1.map((value2, index2) => value2 + matrix2[index1][index2])))
}

console.log(matrixAddition([[1, 2], [1, 2]], [[2, 3], [2, 3]])); //[ [3, 5], [3, 5] ]
console.log(matrixAddition([[1, 2, 3], [3, 2, 1], [1, 1, 1]], [[2, 2, 1], [3, 2, 3], [1, 1, 3]]));// [[3,4,4],[6,4,4],[2,2,4]]